"""Игра найди пару.

Перед вами будет поле 4 на 4 клетки.
Ваша задача найти на этоп поле пары одинаковый вкусностей.
Нажмите на закрытое поле, чтобы покзаать какая там спрятана вкусность.
Теперь сделайте так же с ещё одним полем.
Если вкусности совпадают - вы нашли пару.
Если не совпали, то поля снова закрываются.

Довольно простая игра, которая развивает память.


Предоставляет
-------------

- /pair - Начтаь игру найди пару

Version: v0.2
Author: Milinuri Nirvalen
"""

from random import shuffle

import arc
import hikari
import miru

# Глобальные переменные
# =====================

plugin = arc.GatewayPlugin("Find pair")

# Перечисляем все варианты вкусностей
# Поскольку в коде они будут представлены как число от 0 до 8
# Теоретически так мы сможем сделать несколько стилей для игры
_PAIRS = [
    "🍌", "🍓", "🍇", "🍞", "🥐", "🍫", "🍦","☕",
]


# Классы представления игровых объектов
# =====================================

class GameButton(miru.Button):
    """Поле со вкусностью.

    Данная кнопка представляет собой поле, в коотром спрятана вкусность.
    Как только вы нажимаете на поле, то оно становится открытм и
    показывает, что в нём находится.
    Если послеэ того найти для него пару, то данное поле станет
    помечено как завершённое и не будет закрыто.
    Иначе, следующим ходом поле вновь закроется.

    :param pair: Какую пару представляет данное поле (0-8).
    :type pair: int
    :param row: Нв каком ряду находится данная кнопка (0-3).
    :type row: int
    """

    def __init__(self, pair: int, row: int) -> None:
        super().__init__(
            label="⬛",
            style=hikari.ButtonStyle.SECONDARY,
            row=row
        )
        self.pair = pair

    async def callback(self, ctx: miru.ViewContext):
        """Действие при нажатии на кнопку.

        Для начала данная игра не ограничивает количество игроков.
        Так что тут нет проверки на то, кто нажал кнопки и может ли он
        это сделать.
        После нажатия на поле, вызывается метод для его открытия.
        Также проверяется, не закончилась ли игра.
        Если игра ещё идёт, обновялем сообщение статуса.
        В ином случае отправлям сообщение об успешном окончании игры.

        :param ctx: Контекст нажатия кнопки, кто нажал, в каком чате.
        :type ctx: miru.ViewContext
        """
        self.view.open_pair(self)
        game_over = self.view.is_game_over()
        if game_over:
            await ctx.edit_response(
                embed=self.view.end_game_message(),
                components=self.view
            )
            self.view.stop()
        else:
            await ctx.edit_response(
                embed=self.view.game_status(),
                components=self.view
            )

    def set_open(self) -> None:
        """Помечает данную кнопку как открытую."""
        self.disabled = True
        self.style = hikari.ButtonStyle.PRIMARY
        self.label = _PAIRS[self.pair]

    def set_close(self) -> None:
        """Помечает кнопка как закрытую, скрывая её содержимое."""
        self.disabled = False
        self.style = hikari.ButtonStyle.SECONDARY
        self.label = "⬛"

    def set_completed(self) -> None:
        """Помечает кнопку как успешно найденную пару для неё."""
        self.disabled = True
        self.style = hikari.ButtonStyle.SUCCESS
        self.label = _PAIRS[self.pair]


class PairView(miru.View):
    """Представляет собой игровое поел для игры найди пару.

    У вас есть 4 на 4 поля.
    В каждом из них спратяна вкусноть.
    Ваша задача открыть все поля, найдя пары всем вкусностям.
    """

    def __init__(self):
        super().__init__()

        self._board = []
        self.first_open: GameButton | None = None
        self.secons_open: GameButton | None = None
        self.pair_left = 0

        self.new_game()

    def new_game(self) -> None:
        """Наичинает новую игру.

        Сбрасывает данные старой игры, раскладывает вкусности в случаных
        местах.
        """
        self._board.clear()
        self.first_open = None
        self.secons_open = None
        self.pair_left = 8

        for x in range(8):
            self._board.append(x)
            self._board.append(x)
        shuffle(self._board)

        for i, pair in enumerate(self._board):
            row = i // 4
            self.add_item(GameButton(pair, row=row))

    def open_pair(self, button: GameButton) -> None:
        """Открывает нажатую клетку.

        Алгоритм открытия клеток следующий:
        - Если это первая клетка в паре - открываем её.
        - Если это вторая, то проверяем, не совпадает ли она с первой.
            - Если совпала, то помечаем как найденную пару.
            - Если нет, то просто открываем.
        - Если две разные клетки ранее были открыты, то закрываем их.

        :param button: Кнопка, на которую нажали чтбы открыть клетку.
        :type button: GameButton
        """
        if self.first_open is not None and self.secons_open is not None:
            self.first_open.set_close()
            self.first_open = None

            self.secons_open.set_close()
            self.secons_open = None

        if self.first_open is None:
            self.first_open = button
            button.set_open()

        elif self.secons_open is None:
            if self.first_open.pair == button.pair:
                self.first_open.set_completed()
                self.first_open = None
                button.set_completed()
                self.pair_left -= 1
            else:
                button.set_open()
                self.secons_open = button

    def is_game_over(self) -> bool:
        """Проверяет не завершилась ли игра.

        Игра считается завершённой, когда найдены все пары.
        """
        return self.pair_left <= 0

    def end_game_message(self) -> hikari.Embed:
        """Сообщение об успешном завершении игры.

        :return: Сообщение с результатами игры.
        :rtype: hikari.Embed
        """
        return hikari.Embed(
            title="☕ Найди пару / игра окончена",
            description="Поздравляем, вы успешо нашли все пары",
            color=hikari.colors.Color(0x8ff0a4)
        )

    def game_status(self) -> hikari.Embed:
        """Сообщение с текущим статусом игры.

        Содержит небольшое описание игры с правилами, а также отображает
        количество оставшихся пар, до завершения игры.

        :return: Сообщение с текущим статусом игры.
        :rtype: hikari.Embed
        """
        return hikari.Embed(
            title="☕ Найди пару",
            description=(
                "Ваша заача найти пару для всех вкусностей.\n"
                "- Нажмите на поле, чтобы открыть его.\n"
                "- Два одинаковых поля образуют пару.\n"
                "- Не одинаковые поля будут закрываться."
            ),
            color=hikari.colors.Color(0x00ccff)
        ).add_field("Пар осталось", str(self.pair_left))


# определение команд
# ==================

@plugin.include
@arc.slash_command("pair", description="Игра найди пару.")
async def nya_handler(
    ctx: arc.GatewayContext,
    client: miru.Client = arc.inject()
) -> None:
    """Начинает ноувю игру Найди пару."""
    view = PairView()
    await ctx.respond(view.game_status(), components=view)
    client.start_view(view)


# Загрузчики и выгрузчики плагина
# ===============================

@arc.loader
def loader(client: arc.GatewayClient) -> None:
    """Действия при загрузке плагина."""
    client.add_plugin(plugin)

@arc.unloader
def unloader(client: arc.GatewayClient) -> None:
    """Действия при выгрузке плагина."""
    client.remove_plugin(plugin)
