"""Коробка с игрушками.

Расширение, которое предоставляет различные забавные команды без
какой-либо определённой тематики.

Предоставляет
-------------

- /ping: Проверить что бот работает.

Version: v0.2 (2)
Author: Milinuri Nirvalen
"""

import random

import arc
import hikari

plugin = arc.GatewayPlugin("funbox")


# определение команд
# ==================


@plugin.include
@arc.slash_command("ping", description="Проверить что бот работает")
async def ping(ctx: arc.GatewayContext):
    """Проверить что бот в сети."""
    await ctx.respond("Понг!")


# Простенькие игры -------------------------------------------------------------


@plugin.include
@arc.slash_command("dice", description="Подбросить кубик")
async def dice(
    ctx: arc.GatewayContext,
    sides: arc.Option[int, arc.IntParams("Сколько сторон у кубика (6)")] = 6,
    count: arc.Option[int, arc.IntParams("Сколько будет кубиков (1)")] = 1,
):
    """Подбрасывает кубик.

    По умолчанию подбрасывает 1 кубик с 6-тью гранями.
    Вы можете переопределить, сколько будет кубиков и сколько будет
    у них граней.
    Сообщение с результатом содержит настройки кубиков, результаты для
    подброса каждого кубика и конечную сумму.
    """
    # Валидация входящих параметров
    sides = min(max(3, sides), 100)
    count = min(max(1, count), 10)
    if count > 1:
        result = [random.randint(1, sides) for _ in range(count)]
    else:
        result = random.randint(1, sides)

    # Собираем красивое сообщение
    emb = hikari.Embed(
        title="🎲 Подбросили кубики",
        description=(
            "Вы берёте свои любимые кубики.\n"
            "Немного потреся их в ладонях, вы, лёгким движением руки,"
            "выбрасываете их на стол.\n\n"
            "Чтоже тут у нас?"
        ),
        color=hikari.colors.Color(0xF66151),
    )

    # Доабвляем рузальтат подсчётов
    if count == 1:
        emb.add_field(name="Итого", value=str(result))
    else:
        str_value = str(result[0])
        for r in result[1:]:
            str_value += f" + {r}"
        str_value += f" = {sum(result)}"
        emb.add_field(name="Итого", value=str_value)

    return await ctx.respond(embed=emb)


_FLIP_RESULTS = ["Орла", "Решку"]


@plugin.include
@arc.slash_command("flip", description="Подбросить монетку")
async def flip_handler(ctx: arc.GatewayContext):
    """Подбрасывает монетку.

    Вы можете подбросить только одну монетку.
    В рузльтате может выпаст орёл или решка.
    Сообщение с результатом содержит выпавшую сторону монетки.
    """
    result = random.randint(0, 1)
    result_str = _FLIP_RESULTS[result]
    await ctx.respond(f"🪙 Подбросив монетку вы увидели там {result_str}")


# 8шар -------------------------------------------------------------------------

_BALL_PREFIX = [
    "соверенно точно ",
    "определённо ",
    "скорее всего ",
    "звезды подчказывают что ",
    "возможно ",
    "вероятно ",
]

_BALL_RESULT = ["да", "нет", "попробуйте позже", "не знаю", "не уверен"]


@plugin.include
@arc.slash_command("ball", description="Получить совет от шара")
async def flip_handler(ctx: arc.GatewayContext):
    """8 шар.

    Вы можете задать любой вопрос, а мудрый шар подскажет вам ответ.
    На самом деле ответ подбирается случайный.
    Но так ведь даже веселее.
    """
    if random.randint(0, 1) == 1:
        prefix = random.choice(_BALL_PREFIX)
    else:
        prefix = ""
    result = random.choice(_BALL_RESULT)

    await ctx.respond(f"🔮 **Мудрый шар говорит Вам**:\n\n> {prefix}{result}")


# Загрузчики и выгрузчики плагина
# ===============================


@arc.loader
def loader(client: arc.GatewayClient) -> None:
    client.add_plugin(plugin)


@arc.unloader
def unloader(client: arc.GatewayClient) -> None:
    client.remove_plugin(plugin)
