"""Расширение для сервера ModCraft.

Сделано с целью интеграции с одноимённым сервером Discord.

Предоставляет
-------------

Version: v0.1 (1)
Author: Milinuri Nirvalen
"""

from datetime import UTC, datetime

import arc
import hikari

# Глобальные переменные
# =====================

plugin = arc.GatewayPlugin("ModCraft")
_RULE_TIMESTAMP = datetime(2024, 6, 6, 15, 49, tzinfo=UTC)


def _server_embed() -> hikari.Embed:
    emb = hikari.Embed(
        title="🎮 Сервер ModCraft",
        description=(
            "**ModCraft** — это уникальный сервер Minecraft, созданный для любителей модов.\n"
            "Здесь вы найдете множество интересных модификаций, которые добавят новые механики, предметы и возможности в вашу игру."
        ),
        color=0x814634,
        timestamp=_RULE_TIMESTAMP,
    )
    emb.add_field(
        name="🎁 События",
        value=(
            "Конкурсы и ивенты: Мы регулярно проводим конкурсы и ивенты с призами для активных игроков.\n\n"
        ),
    )
    emb.add_field(
        name="🌟 Особенности",
        value=(
            "**Моды**: Наш сервер предлагает множество популярных модов, таких как IndustrialCraft 2, Forestry, Thaumcraft, Tinkers' Construct и многие другие.\n"
            "**Кастомные механики**: Мы добавили уникальные механики и квесты, которые сделают вашу игру еще более интересной и разнообразной.\n"
            "**Комьюнити**: У нас дружелюбное и активное сообщество игроков, которые всегда готовы помочь новичкам и поделиться опытом.\n"
            "**Регулярные обновления**: Мы постоянно обновляем сервер, добавляя новые моды, исправляя баги и улучшая игровой процесс.\n"
        ),
    )
    emb.add_field(
        name="🍷 Правила сервера",
        value=(
            "1.Уважайте других игроков\n"
            "2.Не используйте читы или эксплоиты\n"
            "3.Следуйте указаниям администрации\n"
        ),
    )

    return emb


def _rules_embed() -> hikari.Embed:
    emb = hikari.Embed(
        title="☕ Правила сервера ModCraft",
        description=(
            "1.Запрещено строить лаг-машины\n"
            "Нарушение данного правила приведет к постоянному бану.\n\n"
            "2.Оскорбление игроков\n"
            "за Направленное оскорбление конкретного игрока бан на 1 месяц\n\n"
            "3.Уничтожение объектов общего пользования\n"
            "В зависимости от сезона, бан на 3 месяца\n\n"
            "4.Распространение непристойного контента\n"
        ),
        color=0x814634,
        timestamp=_RULE_TIMESTAMP,
    )

    return emb


# определение команд
# ==================

cmd_group = plugin.include_slash_group(
    name="mc", description="Взаимодействие с сервером ModCraft"
)


@cmd_group.include
@arc.slash_subcommand("info", description="Информация о сервере.")
async def server_info(
    ctx: arc.GatewayContext,
) -> None:
    """Общая информация о сервере.

    Позволяет новым участника больше узнать о сервере.
    """
    await ctx.respond(_server_embed())


@cmd_group.include
@arc.slash_subcommand("rules", description="Правила discord сервера.")
async def server_rules(
    ctx: arc.GatewayContext,
) -> None:
    """Правила Discord сервера.

    Позволяет новым участникам ознакомиться с командами сервера.
    """
    await ctx.respond(_rules_embed())


# Загрузчики и выгрузчики плагина
# ===============================


@arc.loader
def loader(client: arc.GatewayClient) -> None:
    """Действия при загрузке плагина."""
    client.add_plugin(plugin)


@arc.unloader
def unloader(client: arc.GatewayClient) -> None:
    """Действия при выгрузке плагина."""
    client.remove_plugin(plugin)
